// Lab_02.cpp
// Пиндиківська Вероніка Олегівна
// Лабораторна робота № 2.1
// Лінійні програми.
// Варіант 14
#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	double alpha; // вхідний параметр
	double z1;    // результат обчислення 1-го виразу
	//double z2;    // результат обчислення 2-го вираз
	cout << "alpha = "; // Виведення підказки для користувачая
	cin >> alpha; // Введення значення параметра
	z1 = (cos(alpha) + sin(alpha)) / (cos(alpha) - sin(alpha));// Обчислення z1 за першою формулою: (cos(a) + sin(a)) / (cos(a) - sin(a))
	//z2 = tan(2 * alpha) + 1.0 / cos(2 * alpha);// Обчислення z2 за другою формулою: tan(2a) +sec(2a) (квадрат секанса дорівнює (1/cos^2(a)).
	cout << endl; // Перехід на новий рядок для зручності читання

	cout << "z1 = " << z1 << endl; // Виведення обчисленого значення z1
	//cout << "z2 = " << z2 << endl; // Виведення обчисленого значення z2

	return 0; // Повернення 0 (сигнал успішного завершення програми)
}
// Перша зміна для завдання

